In [1]:
import pandas as pd
import numpy as np

In [4]:
people = {"first":["Corey", "Jane", "John", "Chris", np.nan, None, "NA"],
          "last":["Schafer", "Doe", "Doe", "Schafer", np.nan, np.nan, "Missing"],
          "email":["CoreyMSchafer@gmail.com", "JaneDoe@email.com", "JohnDoe.email.com", None, np.nan, "Anonymous@email.com", "NA"],
          "age":["33","55", "63", "36", None, None, "Missing"]}

In [16]:
df = pd.DataFrame(people)

In [17]:
df.replace("NA", np.nan, inplace=True)
df.replace("Missing", np.nan, inplace=True)

In [18]:
df.dropna() # equal to below

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@email.com  55
2   John      Doe        JohnDoe.email.com  63

In [19]:
df.dropna(axis="index", how="any") # default args, with any missing values

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@email.com  55
2   John      Doe        JohnDoe.email.com  63

In [20]:
df.dropna(axis="index", how="all")

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe.email.com    63
3  Chris  Schafer                     None    36
5   None      NaN      Anonymous@email.com  None

In [21]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

In [23]:
df.fillna("MISSING")

     first     last                    email      age
0    Corey  Schafer  CoreyMSchafer@gmail.com       33
1     Jane      Doe        JaneDoe@email.com       55
2     John      Doe        JohnDoe.email.com       63
3    Chris  Schafer                  MISSING       36
4  MISSING  MISSING                  MISSING  MISSING
5  MISSING  MISSING      Anonymous@email.com  MISSING
6  MISSING  MISSING                  MISSING  MISSING

In [24]:
df.dtypes # object string or mixed

first    object
last     object
email    object
age      object
dtype: object

In [25]:
df["age"] = df["age"].astype(float)

In [26]:
df.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [27]:
df["age"].mean()

46.75

In [14]:
df.dropna(axis="index", how="all", subset=["last", "email"]) #", inplace=True" # second filter is "email"